Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: In order to use this in a cross-compilation setting, we need to tell pkg-config to inject the actual sysroot into -I and -L variables.
it_it: Per usarlo in un'impostazione di cross-compilazione, dobbiamo dire a pkg-config di inserire l'attuale sysroot nelle variabili -I e -L.

source: In particular, it prevents you from writing Foo<sizeof(htonl(x))>(), where Foo is a template that has an integral argument.
it_it: In particolare, impedisce di scrivere Foo<sizeof(htonl(x))>(), dove Foo è un template che ha un argomento intero.

source: In particular, nesting NiceMock and StrictMock (e.g. NiceMock<StrictMock<MockFoo> >) is not supported.
it_it: In particolare, la nidificazione di NiceMock e di StrictMock (ad esempio NiceMock<StrictMock<MockFoo> >) non è supportata.

source: In particular, using it in GoogleTest comparison assertions (EXPECT_EQ, etc.) will generate an "undefined reference" linker error.
it_it: In particolare, utilizzarlo nelle asserzioni di confronto di GoogleTest (EXPECT_EQ, ecc.) genererà un errore del linker "undefined reference".

source: In particular, you cannot find the test suite name in SetUpTestSuite(), TearDownTestSuite() (where you know the test suite name implicitly), or functions called from them.
it_it: In particolare, non è possibile trovare il nome della test suite in SetUpTestSuite(), TearDownTestSuite() (dove si conosce implicitamente il nome della test suite) né nelle funzioni chiamate da essi.

source: In reality, sometimes you do need to mock a virtual method that is not pure (i.e, it already has an implementation).
it_it: In realtà, a volte è necessario creare la mock di un metodo virtuale che non è puro (ovvero ha già un'implementazione).

source: In tests, you can use a mock implementation instead.
it_it: Nei test è invece possibile utilizzare un'implementazione mock.

source: In DelegateToFake(), you only need to delegate the methods whose fake implementation you intend to use.
it_it: In DelegateToFake(), si devono solo delegare i metodi di cui si intende utilizzare l'implementazione fake.

source: In InvokeArgument<N>(...), if an argument needs to be passed by reference, wrap it inside std::ref().
it_it: In InvokeArgument<N>(...), se un argomento deve essere passato per riferimento, racchiuderlo all'interno di std::ref().

source: In Listing 3 you see that the InitGoogleTest function accepts the arguments to the test infrastructure.
it_it: Nel Listato 3 si vede che la funzione InitGoogleTest accetta gli argomenti per l'infrastruttura di test.

source: In C++, if you *declare* a function with a `const` parameter, the `const` modifier is ignored.
it_it: In C++, se si *dichiara* una funzione con un parametro `const`, il modificatore `const` viene ignorato.

source: In C++, if you declare a function with a const parameter, the const modifier is ignored.
it_it: In C++, se si dichiara una funzione con un parametro const, il modificatore const viene ignorato.

source: In C++11, it will additionally returns the default-constructed value, if one exists for the given type.
it_it: In C++11, restituirà inoltre il valore costruito di default, se ne esiste uno per il tipo specificato.

source: In C++17 and up this also supports types compatible with structured bindings, like aggregates.
it_it: In C++17 e versioni successive supporta anche tipi compatibili con 'binding' strutturate, come gli aggregati.

source: In GoogleTest, death tests are run in a child process and the way they work is delicate.
it_it: In GoogleTest, i death test vengono eseguiti in un processo figlio e il modo in cui funzionano è delicato.

source: In GoogleTest, you share a fixture among test suites by putting the shared logic in a base test fixture, then deriving from that base a separate fixture for each test suite that wants to use this common logic.
it_it: In GoogleTest, si condivide una fixture tra le test suite inserendo la logica condivisa in una fixture di base, poi derivando da quella base una fixture separata per ciascuna test suite che voglia utilizzare questa logica comune.

source: In `DelegateToFake()`, you only need to delegate the methods whose fake implementation you intend to use.
it_it: In `DelegateToFake()`, si devono solo delegare i metodi di cui si intende utilizzare l'implementazione fake.

source: In `InvokeArgument<N>(...)`, if an argument needs to be passed by reference, wrap it inside `std::ref()`.
it_it: In `InvokeArgument<N>(...)`, se un argomento deve essere passato per riferimento, racchiuderlo all'interno di `std::ref()`.

source: In a **unit** test, it's best if you could isolate and test a piece of code in a single-threaded context.
it_it: In una **unit** test, è meglio isolare e testare una parte di codice in un contesto a thread singolo.

source: In a unit test, it's best if you could isolate and test a piece of code in a single-threaded context.
it_it: In una unit test, è meglio isolare e testare una parte di codice in un contesto a thread singolo.

source: In addition, GoogleTest might also require -pthread in the compiling step, and as such splitting the pkg-config Cflags variable into include dirs and macros for target_compile_definitions() might still miss this).
it_it: Inoltre, GoogleTest potrebbe anche richiedere -pthread nella fase di compilazione e, di conseguenza, dividere la variabile Cflags di pkg-config in include dir e macro per target_compile_definitions() potrebbe ancora perderlo).

source: In addition, NaggyMock<T> can be constructed with any arguments that a constructor of T accepts.
it_it: Inoltre, NaggyMock<T> può essere costruito con qualsiasi argomento accettato dal costruttore di T.

source: In addition, StrictMock<T> can be constructed with any arguments that a constructor of T accepts.
it_it: Inoltre, StrictMock<T> può essere costruito con qualsiasi argomento accettato dal costruttore di T.

source: In addition, GoogleTest might also require `-pthread` in the compiling step, and as such splitting the pkg-config `Cflags` variable into include dirs and macros for `target_compile_definitions()` might still miss this).
it_it: Inoltre, GoogleTest potrebbe anche richiedere `-pthread` nella fase di compilazione e, di conseguenza, dividere la variabile `Cflags` di pkg-config in include dir e macro per `target_compile_definitions()` potrebbe ancora perderlo).

source: In addition, `NaggyMock<T>` can be constructed with any arguments that a constructor of `T` accepts.
it_it: Inoltre, `NaggyMock<T>` può essere costruito con qualsiasi argomento accettato dal costruttore di `T`.

source: In addition, `NiceMock<T>` can be constructed with any arguments that a constructor of `T` accepts.
it_it: Inoltre, `NiceMock<T>` può essere costruito con qualsiasi argomento accettato dal costruttore di `T`.

source: In addition, `StrictMock<T>` can be constructed with any arguments that a constructor of `T` accepts.
it_it: Inoltre, `StrictMock<T>` può essere costruito con qualsiasi argomento accettato dal costruttore di `T`.

source: In addition, all of this is done with just two switches passed from command line: --gtest_repeat=1000 --gtest_break_on_failure.
it_it: Inoltre, tutto questo viene fatto con solo due opzioni passate sulla riga di comando: --gtest_repeat=1000 --gtest_break_on_failure.

source: In addition, if FooType is declared in a name space, the << operator also needs to be defined in the same name space.
it_it: Inoltre, se FooType è dichiarato in un namespace, anche l'operatore << deve essere definito nello stesso namespace.

source: In addition, if `FooType` is declared in a name space, the `<<` operator also needs to be defined in the *same* name space.
it_it: Inoltre, se `FooType` è dichiarato in un namespace, anche l'operatore `<<` deve essere definito nello *stesso* namespace.

source: In between, the tests can use the shared resources.
it_it: Nel mezzo, i test possono utilizzare le risorse condivise.

source: In both cases, you want the same test logic repeated for different types.
it_it: In entrambi i casi, si desidera che la stessa logica di test venga ripetuta per tipi diversi.

source: In case of assertion failures, GoogleTest prints expected and actual values of type string both as hex-encoded strings as well as in readable UTF-8 text if they contain valid non-ASCII UTF-8 characters.
it_it: In caso di errori di asserzione, GoogleTest stampa i valori previsti ed effettivi di tipo string sia come stringhe con codifica esadecimale sia come testo UTF-8 leggibile se contengono caratteri UTF-8 non ASCII validi.

source: In case of assertion failures, GoogleTest prints expected and actual values of type `string` both as hex-encoded strings as well as in readable UTF-8 text if they contain valid non-ASCII UTF-8 characters.
it_it: In caso di errori di asserzione, GoogleTest stampa i valori previsti ed effettivi di tipo `string` sia come stringhe con codifica esadecimale sia come testo UTF-8 leggibile se contengono caratteri UTF-8 non ASCII validi.

source: In case the array needs to be dynamically created (and therefore the array size cannot be inferred by the compiler), you can give ElementsAreArray() an additional argument to specify the array size:
it_it: Nel caso in cui l'array debba essere creato dinamicamente (e quindi la dimensione dell'array non possa essere dedotta dal compilatore), si può fornire a ElementsAreArray() un argomento aggiuntivo per specificare la dimensione dell'array:

source: In case the array needs to be dynamically created (and therefore the array size cannot be inferred by the compiler), you can give `ElementsAreArray()` an additional argument to specify the array size:
it_it: Nel caso in cui l'array debba essere creato dinamicamente (e quindi la dimensione dell'array non possa essere dedotta dal compilatore), si può fornire a `ElementsAreArray()` un argomento aggiuntivo per specificare la dimensione dell'array:

source: In case the file remains undeleted, the inspected test has exited prematurely.
it_it: Nel caso in cui il file rimanga non eliminato, il test ispezionato è terminato prematuramente.

source: In case we need to subclass the test fixture class, the subclass' constructor is guaranteed to call the base class' constructor first, and the subclass' destructor is guaranteed to call the base class' destructor afterward.
it_it: Nel caso in cui abbiamo bisogno di sottoclassi della classe fixture, è garantito che il costruttore della sottoclasse chiamerà prima quello della classe base e il distruttore della sottoclasse è garantito che chiamerà il distruttore della classe base dopo.

source: In case we need to subclass the test fixture class, the subclass' constructor is guaranteed to call the base class' constructor *first*, and the subclass' destructor is guaranteed to call the base class' destructor *afterward*.
it_it: Nel caso in cui abbiamo bisogno di sottoclassi della classe fixture, è garantito che il costruttore della sottoclasse chiamerà *prima* quello della classe base e il distruttore della sottoclasse è garantito che chiamerà il distruttore della classe base *dopo*.

source: In case you find the built-in set lacking, you can use an arbitrary unary predicate function or functor as a matcher - as long as the predicate accepts a value of the type you want.
it_it: Nel caso in cui si trovi carente il set nativo, si può utilizzare una funzione di predicato unario arbitrario o un funtore come matcher, purché il predicato accetti un valore del tipo desiderato.

source: In contrast, Java and Python programmers have some fine mock frameworks (jMock, EasyMock, etc), which automate the creation of mocks.
it_it: Al contrario, i programmatori Java e Python dispongono di alcuni ottimi framework di simulazione (jMock, EasyMock, ecc.), che automatizzano la creazione di mock.

source: In debug mode, behaves the same as EXPECT_DEATH.
it_it: In modalità debug, si comporta allo stesso modo di EXPECT_DEATH.

source: In debug mode, behaves the same as [`EXPECT_DEATH`](#EXPECT_DEATH).
it_it: In modalità debug, si comporta allo stesso modo di [`EXPECT_DEATH`](#EXPECT_DEATH).

source: In either case, when an assertion fails, it prints the file name, line number, and a message that you can customize.
it_it: In entrambi i casi, quando un'asserzione fallisce, stampa il nome del file, il numero di riga e un messaggio che è possibile personalizzare.

source: In fact, **it's a good style to verify only one thing in one test.** If you do that, a bug will likely break only one or two tests instead of dozens (which case would you rather debug?).
it_it: In effetti, **è buona norma stilistica verificare solo una cosa in un test**. Se lo si fa, un bug probabilmente romperà solo uno o due test invece di dozzine (nel qual caso si vorrebbe eseguire il debug?).

source: In fact, it's a good style to verify only one thing in one test. If you do that, a bug will likely break only one or two tests instead of dozens (which case would you rather debug?).
it_it: In effetti, è buona norma stilistica verificare solo una cosa in un test. Se lo si fa, un bug probabilmente romperà solo uno o due test invece di dozzine (nel qual caso si vorrebbe eseguire il debug?).

source: In fact, you can *declare* `Bar()` with an `int` parameter, and define it with a `const int` parameter.
it_it: Infatti, si può *dichiarare* `Bar()` con un parametro `int` e definirlo con un parametro `const int`.

source: In fact, you can declare Bar() with an int parameter, and define it with a const int parameter.
it_it: Infatti, si può dichiarare Bar() con un parametro int e definirlo con un parametro const int.

source: In frameworks such as CppUnit and CppTest, you need to write substantially more code to generate XML output.
it_it: In framework come CppUnit e CppTest, è necessario scrivere una quantità sostanzialmente maggiore di codice per generare output XML.

source: In frameworks that report a failure by throwing an exception, you could catch the exception and assert on it.
it_it: Nei framework che riportano un errore lanciando un'eccezione, si potrebbe catturare l'eccezione e metterci un assert.

source: In gMock we use the EXPECT_CALL() macro to set an expectation on a mock method.
it_it: In gMock usiamo la macro EXPECT_CALL() per impostare una expectation su un metodo mock.

source: In gMock we use the `EXPECT_CALL()` macro to set an expectation on a mock method.
it_it: In gMock usiamo la macro `EXPECT_CALL()` per impostare una expectation su un metodo mock.

source: In gMock, NiceMock and StrictMock can be used to make a mock class "nice" or "strict".
it_it: In gMock, NiceMock e StrictMock possono essere utilizzati per rendere una classe mock "acondiscendente" [nice] o "rigorosa" [strict].

source: In gMock, `NiceMock` and `StrictMock` can be used to make a mock class "nice" or "strict".
it_it: In gMock, `NiceMock` e `StrictMock` possono essere utilizzati per rendere una classe mock "acondiscendente" [nice] o "rigorosa" [strict].

source: In gMock, if you are not interested in a method, just don't say anything about it.
it_it: In gMock, se non si è interessati a un metodo, non si dice nulla a riguardo.

source: In general, for floating-point comparison to make sense, the user needs to carefully choose the error bound.
it_it: In generale, affinché il confronto in virgola mobile abbia senso, l'utente deve scegliere con attenzione il limite dell'errore.

source: In general, if you find yourself needing to mock a static function, it's a sign that your modules are too tightly coupled (and less flexible, less reusable, less testable, etc).
it_it: In generale, se si deve rendere mock una funzione statica, è segno che i moduli sono accoppiati troppo strettamente (e meno flessibili, meno riutilizzabili, meno testabili, ecc.).

source: In general, the recommended way to cause the code to behave differently under test is Dependency Injection.
it_it: In generale, il modo consigliato per far sì che il codice si comporti diversamente durante il test è la Dependency Injection.

source: In general, the recommended way to cause the code to behave differently under test is [Dependency Injection](https://en.wikipedia.org/wiki/Dependency_injection).
it_it: In generale, il modo consigliato per far sì che il codice si comporti diversamente durante il test è la [Dependency Injection](https://en.wikipedia.org/wiki/Dependency_injection).

source: In many applications, there are assertions that can cause application failure if a condition is not met.
it_it: In molte applicazioni sono presenti asserzioni che possono causare errori dell'applicazione se una condizione non viene soddisfatta.

source: In most cases that just means inheriting from TestWithParam, but more complicated test hierarchies may need to inherit from Test and WithParamInterface at different levels.
it_it: Nella maggior parte dei casi ciò significa semplicemente ereditare da TestWithParam, ma per gerarchie di test più complicate potrebbe essere necessario ereditare da Test e da WithParamInterface a diversi livelli.

source: In most cases that just means inheriting from [`TestWithParam`](#TestWithParam), but more complicated test hierarchies may need to inherit from `Test` and `WithParamInterface` at different levels.
it_it: Nella maggior parte dei casi ciò significa semplicemente ereditare da [`TestWithParam`](#TestWithParam), ma per gerarchie di test più complicate potrebbe essere necessario ereditare da `Test` e da `WithParamInterface` a diversi livelli.

source: In most tests this is not an issue as usually the assertions are done in the main thread.
it_it: Nella maggior parte dei test questo non è un problema poiché di solito le asserzioni vengono fatte nel thread principale.

source: In older code, you may encounter the following workaround for the lack of this feature (it is no longer necessary - we're including it just for reference):
it_it: Nel codice precedente, si potrebbe riscontrare la seguente soluzione alternativa per la mancanza di questa funzionalità (non è più necessaria: la includiamo solo come riferimento):

source: In order for a method to be mocked, it must be *virtual*, unless you use the [high-perf dependency injection technique](gmock_cook_book.md#MockingNonVirtualMethods).
it_it: Affinché un metodo possa essere mock-ato, deve essere *virtual*, a meno che non si utilizzi la [high-perf dependency injection technique](gmock_cook_book.md#MockingNonVirtualMethods).

source: In order for a method to be mocked, it must be virtual, unless you use the high-perf dependency injection technique.
it_it: Affinché un metodo possa essere mock-ato, deve essere virtual, a meno che non si utilizzi la high-perf dependency injection technique.

source: In order for your test runner to figure out which test supports sharding, it can set the environment variable GTEST_SHARD_STATUS_FILE to a non-existent file path.
it_it: Affinché il test runner possa capire quale test supporta lo sharding, può impostare la variabile di ambiente GTEST_SHARD_STATUS_FILE su un path di un file inesistente.

source: In order for your test runner to figure out which test supports sharding, it can set the environment variable `GTEST_SHARD_STATUS_FILE` to a non-existent file path.
it_it: Affinché il test runner possa capire quale test supporta lo sharding, può impostare la variabile di ambiente `GTEST_SHARD_STATUS_FILE` su un path di un file inesistente.

source: In order to avoid an explosion of new macros, we provide them as predicate-format functions that can be used in the predicate assertion macro EXPECT_PRED_FORMAT2, for example:
it_it: Per evitare un'esplosione di nuove macro, le forniamo come funzioni in formato predicato, utilizzabili nella macro di asserzione del predicato EXPECT_PRED_FORMAT2, ad esempio:

source: In order to avoid an explosion of new macros, we provide them as predicate-format functions that can be used in the predicate assertion macro [`EXPECT_PRED_FORMAT2`](reference/assertions.md#EXPECT_PRED_FORMAT), for example:
it_it: Per evitare un'esplosione di nuove macro, le forniamo come funzioni in formato predicato, utilizzabili nella macro di asserzione del predicato [`EXPECT_PRED_FORMAT2`](reference/assertions.md#EXPECT_PRED_FORMAT), ad esempio:

source: In order to specify the call type, the macro name must be suffixed with _WITH_CALLTYPE, and the call type is the first macro argument.
it_it: Per specificare il tipo di chiamata, il nome della macro deve avere il suffisso _WITH_CALLTYPE e il tipo di chiamata è il primo argomento della macro.

source: In order to specify the call type, the macro name must be suffixed with `_WITH_CALLTYPE`, and the call type is the first macro argument.
it_it: Per specificare il tipo di chiamata, il nome della macro deve avere il suffisso `_WITH_CALLTYPE` e il tipo di chiamata è il primo argomento della macro.

source: In order to test your code that uses such a class (let's call it `Concrete`), you may be tempted to make the methods of `Concrete` virtual and then mock it.
it_it: Per testare il codice che utilizza una classe di questo tipo (chiamiamola `Concrete`), si potrebbe essere tentati di rendere virtuali i metodi di `Concrete` e crearne il mock.

source: In order to use this in a cross-compilation setting, we need to tell pkg-config to inject the actual sysroot into `-I` and `-L` variables.
it_it: Per usarlo in un'impostazione di cross-compilazione, dobbiamo dire a pkg-config di inserire l'attuale sysroot nelle variabili `-I` e `-L`.

source: In other cases, you can use the basic EXPECT_TRUE and EXPECT_FALSE assertions.
it_it: In altri casi, si possono utilizzare le asserzioni di base EXPECT_TRUE e EXPECT_FALSE.

source: In other cases, you can use the basic [`EXPECT_TRUE` and `EXPECT_FALSE`](assertions.md#boolean) assertions.
it_it: In altri casi, si possono utilizzare le asserzioni di base [`EXPECT_TRUE` e `EXPECT_FALSE`](assertions.md#boolean).

source: In other words, the last one that matches the function arguments will be used.
it_it: In altre parole, verrà utilizzato l'ultimo che corrisponde agli argomenti della funzione.

source: In other words, the **last** one that matches the function arguments will be used.
it_it: In altre parole, verrà utilizzato l'**ultimo** che corrisponde agli argomenti della funzione.

source: In other words, the calls don't have to occur in the order the expectations are specified.
it_it: In altre parole, le chiamate non devono avvenire nell'ordine in cui sono specificate le expectation.

source: In other words, the test isn't interested in the x.Y() method at all, as evident in that the test doesn't care to say anything about it.
it_it: In altre parole, il test non è affatto interessato al metodo x.Y(), come è evidente dal fatto che al test non interessa dire nulla al riguardo.

source: In other words, the test isn't interested in the `x.Y()` method at all, as evident in that the test doesn't care to say anything about it.
it_it: In altre parole, il test non è affatto interessato al metodo `x.Y()`, come è evidente dal fatto che al test non interessa dire nulla al riguardo.

source: In other words, they should retire as soon as they are saturated:
it_it: In altre parole, dovrebbero ritirarsi appena saturate:

source: In other words, they should *retire* as soon as they are saturated:
it_it: In altre parole, dovrebbero *ritirarsi* appena saturate:

source: In other words, you must be able to call Perform<R>(args) where R is the mock function's return type and args is its arguments in a tuple.
it_it: In altre parole, si deve essere in grado di chiamare Perform<R>(args) dove R è il tipo restituito dalla funzione mock e args è il suo argomenti in una tupla.
